anyway-blows/ti-c2000-motor-control-sdk/c2000ware/libraries/diagnostic/f28002x/examples/test_application/sta_tests.c
//#############################################################################
//
// FILE:  sta_tests.c
//
// TITLE: Self Test Application Tests source
//
//#############################################################################
// $TI Release: C2000 Diagnostic Library v2.01.00 $
// $Release Date: Fri Feb 12 19:23:23 IST 2021 $
// $Copyright:
// Copyright (C) 2021 Texas Instruments Incorporated - http://www.ti.com/
//
// Redistribution and use in source and binary forms, with or without 
// modification, are permitted provided that the following conditions 
// are met:
// 
//   Redistributions of source code must retain the above copyright 
//   notice, this list of conditions and the following disclaimer.
// 
//   Redistributions in binary form must reproduce the above copyright
//   notice, this list of conditions and the following disclaimer in the 
//   documentation and/or other materials provided with the   
//   distribution.
// 
//   Neither the name of Texas Instruments Incorporated nor the names of
//   its contributors may be used to endorse or promote products derived
//   from this software without specific prior written permission.
// 
// THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS 
// "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT 
// LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
// A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT 
// OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, 
// SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT 
// LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
// DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
// THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT 
// (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE 
// OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
// $
//#############################################################################

//
// Included Files
//
#include "driverlib.h"
#include "device.h"

#include "sta_tests.h"
#include "sta_user.h"
#include "sta_util.h"
#include "sta_comm.h"
#include "sta_timer.h"
#include "stl_util.h"

#include <stdio.h>

//
// Defines
//
#define STA_TESTS_REPORT_SIZE       29
#define STA_TESTS_REPORT_TOTAL      15
#define STA_TESTS_REPORT_PASS       5

//
// Globals
//
const STA_TestsTypes STA_Tests_testArray[STA_TESTS_NUMBERS] =
{
    STA_TEST_START,
    STA_HWBIST_MICRO,
    STA_HWBIST_FULL,
    STA_TEST_PIE_RAM,
    STA_TEST_PIE_HANDLER,
    STA_CPU_REG,
    STA_FPU_REG,
    STA_VCRC_REG,
    STA_MARCH,
    STA_MARCH_COPY,
    STA_MARCH_CAN,
    STA_MARCH_CAN_COPY,
    STA_CAN_RAM_PARITY,
    STA_FLASH_CRC,
    STA_OSC_CT,
    STA_OSC_HR,
    STA_TEST_END
};

#if STA_UTIL_PROFILE
uint32_t STA_Tests_cycleCounts[STA_TESTS_NUMBERS] = {0};
#endif

static uint16_t STA_Tests_passCount = 0U;
static unsigned char STA_Tests_report[STA_TESTS_REPORT_SIZE] =
    {
        '\r','\n','\n','\n',' ','X',
        'X',' ','o','u','t',' ','o',
        'f',' ','X','X',' ','t','e',
        's','t','s',' ','P','A','S',
        'S','\0'
    };

static bool STA_Tests_injectError;

#if STA_UTIL_HWBIST_MICRO
volatile uint16_t STA_Tests_hwbistCounterMicro = 0;
volatile uint32_t STA_Tests_memDumpMicro[20];
volatile uint16_t STA_Tests_memDumpMicroIndex;
#endif
#if STA_UTIL_HWBIST_FULL
volatile uint16_t STA_Tests_hwbistCounterFull = 0;
volatile uint32_t STA_Tests_memDumpFull[20];
volatile uint16_t STA_Tests_memDumpFullIndex;
#endif

//*****************************************************************************
//
// STA_Tests_testDevice(STA_TestsTypes testItem)
//
//*****************************************************************************
unsigned char* STA_Tests_testDevice(STA_TestsTypes testItem)
{

    unsigned char *testReport;

    switch(testItem)
    {
        case STA_TEST_START:
        {
            testReport = "\r\n\n\n Starting Test Loop\0";

            STA_Tests_passCount = 0U;

            break;
        }

#if STA_UTIL_HWBIST_MICRO
        case STA_HWBIST_MICRO:
        {
            uint16_t returnVal = 0;
            uint32_t previousNMIVector = HWREG(PIEVECTTABLE_BASE +
                                               PIEVECTTABLE_O_NMI);

            //
            // Reset and Initialize the HWBIST.
            //
            STL_HWBIST_init(STL_HWBIST_90_LOS);

            STL_Util_clearErrorFlag(STL_UTIL_HWBIST_NMI_TEST);
            STL_Util_clearErrorFlag(STL_UTIL_HWBIST_FAIL);
            STL_Util_clearErrorFlag(STL_UTIL_HWBIST_NMI_INT);
            STL_Util_clearErrorFlag(STL_UTIL_HWBIST_OVERRUN);

            STL_HWBIST_Error error;

            //
            // Inject an error.
            //
            switch(STA_Tests_hwbistCounterMicro % 5)
            {
                case 0:
                {
                    error = STL_HWBIST_NO_ERROR; // returnVal = 0x0002

                    //
                    // Reset the memory dump address.
                    //
                    STA_Tests_memDumpMicroIndex = 0U;
                    break;
                }
                case 1:
                {
                    error = STL_HWBIST_TIMEOUT; // returnVal = 0x0029
                    break;
                }
                case 2:
                {
                    error = STL_HWBIST_FINAL_COMPARE; // returnVal = 0x0002
                    break;
                }
                case 3:
                {
                    error = STL_HWBIST_NMI_TRAP; // returnVal = 0x00000
                    break;
                }
                case 4:
                {
                    error = STL_HWBIST_LOGIC_FAULT; // returnVal = 0x0002
                    break;
                }
            }

            if(STA_Tests_injectError)
            {
                STA_Tests_hwbistCounterMicro++;
            }
            else
            {
                STA_Tests_hwbistCounterMicro = 0;
            }

            //
            // Inject error or no error.
            //
            STL_HWBIST_injectError(error);

