anyway-blows/ti-c2000-motor-control-sdk/c2000ware/libraries/diagnostic/f28002x/examples/test_application/sta_tests.c
#if STA_UTIL_PROFILE
            STA_Util_startProfiler(CPUTIMER1_BASE);
#endif
            //
            // Run a micro-run of HWBIST.
            //
            returnVal = STL_HWBIST_runMicro();

#if STA_UTIL_PROFILE
            uint32_t cycleCount = STA_Util_stopProfiler(CPUTIMER1_BASE);
            STA_Tests_cycleCounts[STA_HWBIST_MICRO] = cycleCount;
#endif

            if(STL_HWBIST_MACRO_DONE == (returnVal & STL_HWBIST_MACRO_DONE))
            {
                if((returnVal & ~(STL_HWBIST_BIST_DONE | STL_HWBIST_MACRO_DONE))
                    != 0)
                {
                    testReport = "\r\n\n\n TEST FAIL: HWBIST Micro!\0";
                }
                else
                {
                    STA_Tests_passCount++;
                    testReport = "\r\n\n\n TEST PASS: HWBIST Micro!\0";
                }
            }
            else
            {
                testReport = "\r\n\n\n TEST FAIL: HWBIST Micro!\0";
            }

            if(STA_Tests_injectError)
            {
                STA_Tests_memDumpMicro[STA_Tests_memDumpMicroIndex++] = error;

                if(HWREG(PIEVECTTABLE_BASE + PIEVECTTABLE_O_NMI) ==
                                                            previousNMIVector)
                {
                    STA_Tests_memDumpMicro[STA_Tests_memDumpMicroIndex++] =
                                                                    0xAAAAAAAA;
                }
                else
                {
                    STA_Tests_memDumpMicro[STA_Tests_memDumpMicroIndex++] =
                                                                    0xDEADBEEF;
                }

                STA_Tests_memDumpMicro[STA_Tests_memDumpMicroIndex++] = returnVal;
                STA_Tests_memDumpMicro[STA_Tests_memDumpMicroIndex++] =
                    STL_Util_getErrorFlag();
            }

        break;
        }
#endif

#if STA_UTIL_HWBIST_FULL
        case STA_HWBIST_FULL:
        {
            uint16_t returnVal = 0;
            uint32_t previousNMIVector = HWREG(PIEVECTTABLE_BASE +
                                               PIEVECTTABLE_O_NMI);

            STL_Util_clearErrorFlag(STL_UTIL_HWBIST_NMI_TEST);
            STL_Util_clearErrorFlag(STL_UTIL_HWBIST_FAIL);
            STL_Util_clearErrorFlag(STL_UTIL_HWBIST_NMI_INT);
            STL_Util_clearErrorFlag(STL_UTIL_HWBIST_OVERRUN);

            STL_HWBIST_Error error = STL_HWBIST_NO_ERROR;

            //
            // Inject an error.
            //
            switch(STA_Tests_hwbistCounterFull % 5)
            {
                case 0:
                {
                    error = STL_HWBIST_NO_ERROR; // returnVal = 0x0003
                    STA_Tests_memDumpFullIndex = 0U;
                    break;
                }
                case 1:
                {
                    error = STL_HWBIST_TIMEOUT; // returnVal = 0x0029
                    break;
                }
                case 2:
                {
                    error = STL_HWBIST_FINAL_COMPARE; // returnVal = 0x0003
                    break;
                }
                case 3:
                {
                    error = STL_HWBIST_NMI_TRAP; // returnVal = 0x0005
                    break;
                }
                case 4:
                {
                    error = STL_HWBIST_LOGIC_FAULT; // returnVal = 0x001B
                    break;
                }
            }

            if(STA_Tests_injectError)
            {
                STA_Tests_hwbistCounterFull++;
            }
            else
            {
                STA_Tests_hwbistCounterFull = 0;
            }

#if STA_UTIL_PROFILE
            STA_Util_startProfiler(CPUTIMER1_BASE);
#endif
            //
            // Run the full HWBIST test until complete.
            //
            returnVal = STL_HWBIST_runFull(error);

#if STA_UTIL_PROFILE
            uint32_t cycleCount = STA_Util_stopProfiler(CPUTIMER1_BASE);
            STA_Tests_cycleCounts[STA_HWBIST_FULL] = cycleCount;
#endif

            if(STL_HWBIST_BIST_DONE == (returnVal & STL_HWBIST_BIST_DONE))
            {
                if((returnVal & ~(STL_HWBIST_BIST_DONE | STL_HWBIST_MACRO_DONE))
                    != 0)
                {
                    testReport = "\r\n\n\n TEST FAIL: HWBIST Full!\0";
                }
                else
                {
                    STA_Tests_passCount++;
                    testReport = "\r\n\n\n TEST PASS: HWBIST Full!\0";
                }
            }
            else
            {
                testReport = "\r\n\n\n TEST FAIL: HWBIST Full!\0";
            }

            if(STA_Tests_injectError)
            {
                STA_Tests_memDumpFull[STA_Tests_memDumpFullIndex++] = error;
                if(HWREG(PIEVECTTABLE_BASE + PIEVECTTABLE_O_NMI) ==
                                                            previousNMIVector)
                {
                    STA_Tests_memDumpFull[STA_Tests_memDumpFullIndex++] =
                                                                    0xAAAAAAAA;
                }
                else
                {
                    STA_Tests_memDumpFull[STA_Tests_memDumpFullIndex++] =
                                                                    0xDEADBEEF;
                }

                STA_Tests_memDumpFull[STA_Tests_memDumpFullIndex++] = returnVal;
                STA_Tests_memDumpFull[STA_Tests_memDumpFullIndex++] =
                    (uint32_t)(STL_Util_getErrorFlag());
            }

        break;
        }
#endif

        case STA_TEST_PIE_RAM:
        {
            uint16_t entry = STA_USER_PIE_RAM_ENTRY;

            if(STA_Tests_injectError)
            {
                STL_PIE_RAM_injectFault(entry);
            }

#if STA_UTIL_PROFILE
            STA_Util_startProfiler(CPUTIMER1_BASE);
#endif
            //
            // Compare the PIE RAM against the redundant PIE RAM.
            //
            uint16_t returnValue = STL_PIE_RAM_testRAM();

