anyway-blows/ti-c2000-motor-control-sdk/c2000ware/libraries/diagnostic/f28002x/examples/test_application/sta_tests.c
#if STA_UTIL_PROFILE
            uint32_t cycleCount = STA_Util_stopProfiler(CPUTIMER1_BASE);
            STA_Tests_cycleCounts[STA_TEST_PIE_RAM] = cycleCount;
#endif

            if(STL_PIE_RAM_PASS == returnValue)
            {
                STA_Tests_passCount++;
                testReport = "\r\n\n\n TEST PASS: PIE RAM Test!\0";
            }
            else if(returnValue == entry + PIEVECTTABLE_BASE)
            {
                //
                // This is expected when a fault is injected.
                //
                testReport = "\r\n\n\n TEST FAIL: PIE RAM Test!\0";
            }
            else
            {
                testReport = "\r\n\n\n Unexpected Behavior: PIE RAM Test!\0";
            }

            //
            // Restore single vector table entry where error injection was used
            //
            if(STA_Tests_injectError)
            {
                STL_PIE_RAM_restoreVector(entry);
            }

            break;
        }

        case STA_TEST_PIE_HANDLER:
        {
            uint16_t intGroup =
                ((uint16_t)(STA_USER_PIE_TEST_INT & STL_PIE_RAM_TABLE_COL_M) >>
                 STL_PIE_RAM_TABLE_COL_S) - 1U;
            uint16_t intMask = 1U << ((uint16_t)(STA_USER_PIE_TEST_INT &
                                                 STL_PIE_RAM_TABLE_ROW_M) - 1U);

            //
            // This test itself is injecting a fault and verifying that the
            // safety mechanism is working properly, but it can be forced to
            // fail by disabling interrupts and preventing the vector from being
            // fetched.
            //
            if(STA_Tests_injectError)
            {
                DINT;
            }

            //
            // Inject and error in the PIE RAM redundant table and generate
            // an interrupt for that entry. This will test the PIEVERRADDR
            // and PIE RAM mismatch functionality.
            //
#if STA_UTIL_PROFILE
            STA_Util_startProfiler(CPUTIMER1_BASE);
#endif

            uint16_t returnVal = STL_PIE_RAM_testHandler(STA_USER_PIE_TEST_INT);

#if STA_UTIL_PROFILE
            uint32_t cycleCount = STA_Util_stopProfiler(CPUTIMER1_BASE);
            STA_Tests_cycleCounts[STA_TEST_PIE_HANDLER] = cycleCount;
#endif
            if(STL_PIE_RAM_PASS == returnVal)
            {
                STA_Tests_passCount++;
                testReport = "\r\n\n\n TEST PASS: PIE RAM Handler Test!\0";
            }
            else
            {
                testReport = "\r\n\n\n TEST FAIL: PIE RAM Handler Test!\0";
            }

            if(STA_Tests_injectError)
            {
                //
                // Unforce the PIE interrupt.
                //
                HWREGH(PIECTRL_BASE + PIE_O_IFR1 + (intGroup * 2U)) &= ~intMask;

                //
                // Disable the PIE interrupt.
                //
                HWREGH(PIECTRL_BASE + PIE_O_IER1 + (intGroup * 2U)) &= ~intMask;
                Interrupt_clearACKGroup(STA_USER_PIE_TEST_INT_GROUP_M);

                //
                // Unforce the PIE interrupt.
                //
                HWREGH(PIECTRL_BASE + PIE_O_IFR1 + (intGroup * 2U)) &= ~intMask;

                //
                // Disable the PIE interrupt.
                //
                HWREGH(PIECTRL_BASE + PIE_O_IER1 + (intGroup * 2U)) &= ~intMask;

                STL_Util_delayUS(5);

                IFR &= ~STA_USER_PIE_TEST_INT_GROUP_M;

                STL_Util_delayUS(5);
            }

            EINT;

            break;
        }

        case STA_CPU_REG:
        {
            //
            // It's recommended to disable interrupts during this test.
            //
            DINT;
#if STA_UTIL_PROFILE
            STA_Util_startProfiler(CPUTIMER1_BASE);
#endif

            uint16_t returnVal =
                    STL_CPU_REG_checkCPURegisters(STA_Tests_injectError);

#if STA_UTIL_PROFILE
            uint32_t cycleCount = STA_Util_stopProfiler(CPUTIMER1_BASE);
            STA_Tests_cycleCounts[STA_CPU_REG] = cycleCount;
#endif
            EINT;

            if(STL_CPU_REG_PASS == returnVal)
            {
                STA_Tests_passCount++;
                testReport = "\r\n\n\n TEST PASS: CPU Register Test!\0";
            }
            else
            {
                testReport = "\r\n\n\n TEST FAIL: CPU Register Test!\0";
            }

            break;
        }

        case STA_FPU_REG:
        {
            //
            // It's recommended to disable interrupts during this test.
            //
            DINT;
#if STA_UTIL_PROFILE
            STA_Util_startProfiler(CPUTIMER1_BASE);
#endif

            uint16_t returnVal =
                    STL_CPU_REG_checkFPURegisters(STA_Tests_injectError);

#if STA_UTIL_PROFILE
            uint32_t cycleCount = STA_Util_stopProfiler(CPUTIMER1_BASE);
            STA_Tests_cycleCounts[STA_FPU_REG] = cycleCount;
#endif
            EINT;

            if(STL_CPU_REG_PASS == returnVal)
            {
                STA_Tests_passCount++;
                testReport = "\r\n\n\n TEST PASS: FPU Register Test!\0";
            }
            else
            {
                testReport = "\r\n\n\n TEST FAIL: FPU Register Test!\0";
            }

            break;
        }

        case STA_VCRC_REG:
        {
            //
            // It's recommended to disable interrupts during this test.
            //
            DINT;
#if STA_UTIL_PROFILE
            STA_Util_startProfiler(CPUTIMER1_BASE);
#endif

            uint16_t returnVal =
                    STL_CPU_REG_checkVCRCRegisters(STA_Tests_injectError);

#if STA_UTIL_PROFILE
            uint32_t cycleCount = STA_Util_stopProfiler(CPUTIMER1_BASE);
            STA_Tests_cycleCounts[STA_VCRC_REG] = cycleCount;
#endif
            EINT;

            if(STL_CPU_REG_PASS == returnVal)
            {
                STA_Tests_passCount++;
                testReport = "\r\n\n\n TEST PASS: VCRC Register Test!\0";
            }
            else
            {
                testReport = "\r\n\n\n TEST FAIL: VCRC Register Test!\0";
            }

            break;
        }

        case STA_MARCH:
        {
            //
            // Clear RAM error status flags.
            //
            MemCfg_clearUncorrErrorStatus(MEMCFG_UCERR_CPUREAD |
                                          MEMCFG_UCERR_DMAREAD);
            MemCfg_clearCorrErrorStatus(MEMCFG_CERR_CPUREAD);

            //
            // Initialize the inject error handle for stl_march.
            //
            STA_User_initMarch();

            //
            // Inject an error in the memory.
            //
            if(STA_Tests_injectError)
            {
                //
                // This test should always PASS. Cannot inject error in middle
                // of March13N test since the test starts with a write that
                // triggers an update of the ECC.
                //
            }

