anyway-blows/ti-c2000-motor-control-sdk/c2000ware/libraries/diagnostic/f28002x/examples/test_application/sta_tests.c
#if STA_UTIL_PROFILE
            STA_Util_startProfiler(CPUTIMER1_BASE);
#endif

            STL_March_testRAM(STL_MARCH_PATTERN_TWO,
                              (uint32_t)STA_User_marchTestData,
                              (STA_USER_MARCH_DATA_SIZE / 2U) - 1U);

#if STA_UTIL_PROFILE
            uint32_t cycleCount = STA_Util_stopProfiler(CPUTIMER1_BASE);
            STA_Tests_cycleCounts[STA_MARCH] = cycleCount;
#endif

            uint16_t returnVal = STL_March_checkErrorStatus();

            //
            // Clear RAM error status flags.
            //
            MemCfg_clearUncorrErrorStatus(MEMCFG_UCERR_CPUREAD |
                                          MEMCFG_UCERR_DMAREAD);
            MemCfg_clearCorrErrorStatus(MEMCFG_CERR_CPUREAD);

            if(STL_MARCH_PASS == returnVal)
            {
                STA_Tests_passCount++;
                testReport = "\r\n\n\n TEST PASS: March13N No Copy Test!\0";
            }
            else
            {
                //
                // Since there is no way to inject an error for this test,
                // under normal circumstances, this code will not be reached.
                //
                testReport = "\r\n\n\n TEST FAIL: March13N No Copy Test!\0";
            }
            break;
        }

        case STA_MARCH_COPY:
        {
            uint32_t originalValue;
            uint16_t index;

            //
            // Filling STA_User_marchTestData to make the copy easier to
            // observe.
            //
            for(index = 0; index < STA_USER_MARCH_DATA_SIZE; index++)
            {
                STA_User_marchTestData[index] = index;
            }

            //
            // Clear RAM error status flags.
            //
            MemCfg_clearUncorrErrorStatus(MEMCFG_UCERR_CPUREAD |
                                          MEMCFG_UCERR_DMAREAD);
            MemCfg_clearCorrErrorStatus(MEMCFG_CERR_CPUREAD);

            //
            // Initialize the inject error handle for stl_march.
            //
            STA_User_initMarch();

            //
            // Inject an error in the memory.
            //
            if(STA_Tests_injectError)
            {
                //
                // Cause a single bit error in M0 (ECC, correctable)
                //
                originalValue = HWREG(STA_User_marchErrorObj.address);
                STA_User_marchErrorObj.testMode = MEMCFG_TEST_WRITE_DATA;
                STA_User_marchErrorObj.xorMask = 0x00000001U;
                STL_March_injectError(STA_User_marchErrorHandle);
            }

#if STA_UTIL_PROFILE
            STA_Util_startProfiler(CPUTIMER1_BASE);
#endif

            STL_March_testRAMCopy(STL_MARCH_PATTERN_ONE,
                                  (uint32_t)STA_User_marchTestData,
                                  (STA_USER_MARCH_DATA_SIZE / 2U) - 1U,
                                  (uint32_t)STA_User_marchTestDataCopy);

#if STA_UTIL_PROFILE
            uint32_t cycleCount = STA_Util_stopProfiler(CPUTIMER1_BASE);
            STA_Tests_cycleCounts[STA_MARCH_COPY] = cycleCount;
#endif

            uint16_t returnVal = STL_March_checkErrorStatus();

            //
            // Restore value and clear status flags if error was injected.
            //
            if(STA_Tests_injectError)
            {
                HWREG(STA_User_marchErrorObj.address) = originalValue;
                MemCfg_clearUncorrErrorStatus(MEMCFG_UCERR_CPUREAD |
                                              MEMCFG_UCERR_DMAREAD);
                MemCfg_clearCorrErrorStatus(MEMCFG_CERR_CPUREAD);
            }

            if(STL_MARCH_PASS == returnVal)
            {
                STA_Tests_passCount++;
                testReport = "\r\n\n\n TEST PASS: March13N Copy Test!\0";
            }
            else
            {
                testReport = "\r\n\n\n TEST FAIL: March13N Copy Test!\0";
            }
            break;
        }

        case STA_MARCH_CAN:
        {
            //
            // Initialize the message RAM.
            //
            CAN_initRAM(CANA_BASE);

            //
            // Inject an error in the memory.
            //
            if(STA_Tests_injectError)
            {
                //
                // This test should always PASS. Cannot inject error in middle
                // of March13N test since the test starts with a write that
                // triggers an update of the parity.
                //
            }

#if STA_UTIL_PROFILE
            STA_Util_startProfiler(CPUTIMER1_BASE);
#endif
            //
            // Run March test on 5 message objects starting with object 32
            // (which is also the "0th" spot in the message RAM).
            //
            STL_CAN_RAM_testRAM(CANA_BASE, STL_MARCH_PATTERN_FOUR,
                                STA_USER_MARCH_CANA_OBJ32_START_ADDR,
                                STA_USER_MARCH_CANA_OBJ4_END_ADDR,
                                STL_CAN_RAM_NO_COPY);

#if STA_UTIL_PROFILE
            uint32_t cycleCount = STA_Util_stopProfiler(CPUTIMER1_BASE);
            STA_Tests_cycleCounts[STA_MARCH_CAN] = cycleCount;
#endif

            uint16_t returnVal = STL_CAN_RAM_checkErrorStatus(CANA_BASE);

            if(STL_CAN_RAM_PASS == returnVal)
            {
                STA_Tests_passCount++;
                testReport = "\r\n\n\n TEST PASS: March13N CAN Message RAM Test!\0";
            }
            else
            {
                //
                // Since there is no way to inject an error for this test,
                // under normal circumstances, this code will not be reached.
                //
                testReport = "\r\n\n\n TEST FAIL: March13N CAN Message RAM Test!\0";
            }
            break;
        }

        case STA_MARCH_CAN_COPY:
        {
            uint16_t index, returnVal;

            //
            // Filling message objects to make the copy easier to observe.
            //
            CAN_enableTestMode(CANA_BASE, 0);
            CAN_enableMemoryAccessMode(CANA_BASE);

            for(index = 0; index < STA_USER_MARCH_CAN_COPY_SIZE; index += 2)
            {
                HWREGH(STA_USER_MARCH_CANA_OBJ6_START_ADDR + index) = index;
            }

            CAN_disableMemoryAccessMode(CANA_BASE);
            CAN_disableTestMode(CANA_BASE);

            //
            // Enable parity error to trigger an interrupt.
            //
            CAN_clearGlobalInterruptStatus(CANA_BASE, CAN_GLOBAL_INT_CANINT0);
            CAN_enableInterrupt(CANA_BASE, CAN_INT_ERROR | CAN_INT_IE0);
            CAN_enableGlobalInterrupt(CANA_BASE, CAN_GLOBAL_INT_CANINT0);

