anyway-blows/ti-c2000-motor-control-sdk/c2000ware/libraries/diagnostic/f28002x/examples/test_application/sta_tests.c
            STA_User_canInterruptFlag = false;
            STA_User_parityErrorCode = 0;

            Interrupt_register(INT_CANA0, &STA_User_canParityErrorISR);
            Interrupt_enable(INT_CANA0);

            //
            // Inject an error in the memory.
            //
            if(STA_Tests_injectError)
            {
                //
                // Cause a single bit error in message object 6.
                //
                STL_CAN_RAM_injectError(CANA_BASE,
                                        STA_USER_MARCH_CANA_OBJ6_START_ADDR,
                                        0x00000001U);

                //
                // When injecting an error expect this variable to get set to
                // fail in the ISR, so initialize to PASS.
                //
                STA_User_canErrorReturnVal = STL_CAN_RAM_PASS;
            }

#if STA_UTIL_PROFILE
            STA_Util_startProfiler(CPUTIMER1_BASE);
#endif
            //
            // Run March test on 10 message objects starting with object 6.
            //
            STL_CAN_RAM_testRAM(CANA_BASE, STL_MARCH_PATTERN_THREE,
                                STA_USER_MARCH_CANA_OBJ6_START_ADDR,
                                STA_USER_MARCH_CANA_OBJ15_END_ADDR,
                                (uint32_t)STA_User_marchTestDataCANCopy);

#if STA_UTIL_PROFILE
            uint32_t cycleCount = STA_Util_stopProfiler(CPUTIMER1_BASE);
            STA_Tests_cycleCounts[STA_MARCH_CAN_COPY] = cycleCount;
#endif

            if(!STA_Tests_injectError)
            {
                returnVal = STL_CAN_RAM_checkErrorStatus(CANA_BASE);
            }
            else
            {
                //
                // Interrupt should have had time to fire and set
                // STA_User_canErrorReturnVal by now.
                //
                returnVal = STA_User_canErrorReturnVal;
            }

            if(STL_CAN_RAM_PASS == returnVal)
            {
                STA_Tests_passCount++;
                testReport = "\r\n\n\n TEST PASS: March13N CAN Message RAM Copy Test!\0";
            }
            else
            {
                testReport = "\r\n\n\n TEST FAIL: March13N CAN Message RAM Copy Test!\0";
            }
            break;
        }

        case STA_CAN_RAM_PARITY:
        {
            uint16_t returnVal;

            //
            // This example performs a diagnostic of the parity logic by simply
            // injecting a parity error and detecting it by reading the location
            // of the error.

            //
            // Enable parity error to trigger an interrupt.
            //
            CAN_clearGlobalInterruptStatus(CANA_BASE, CAN_GLOBAL_INT_CANINT0);
            CAN_enableInterrupt(CANA_BASE, CAN_INT_ERROR | CAN_INT_IE0);
            CAN_enableGlobalInterrupt(CANA_BASE, CAN_GLOBAL_INT_CANINT0);

            STA_User_canInterruptFlag = false;
            STA_User_parityErrorCode = 0;

            Interrupt_register(INT_CANA0, &STA_User_canParityErrorISR);
            Interrupt_enable(INT_CANA0);

            //
            // Make sure parity is enabled.
            //
            HWREGH(CANA_BASE + CAN_O_CTL) &= ~CAN_CTL_PMD_M;

            //
            // Inject an error in the memory.
            //
            if(STA_Tests_injectError)
            {
                //
                // Cause a single bit error in message object 6.
                //
                STL_CAN_RAM_injectError(CANA_BASE,
                                        STA_USER_MARCH_CANA_OBJ6_START_ADDR,
                                        0x00000001U);

                //
                // When injecting an error expect this variable to get set to
                // fail in the ISR, so initialize to PASS.
                //
                STA_User_canErrorReturnVal = STL_CAN_RAM_PASS;
            }

#if STA_UTIL_PROFILE
            STA_Util_startProfiler(CPUTIMER1_BASE);
#endif
            //
            // Transfer message from message object 6 to interface 1. This
            // will detect the parity error if one exists.
            //
            CAN_transferMessage(CANA_BASE, 1U, 6U, false, false);

#if STA_UTIL_PROFILE
            uint32_t cycleCount = STA_Util_stopProfiler(CPUTIMER1_BASE);
            STA_Tests_cycleCounts[STA_CAN_RAM_PARITY] = cycleCount;
#endif

            if(!STA_Tests_injectError)
            {
                returnVal = STL_CAN_RAM_checkErrorStatus(CANA_BASE);
            }
            else
            {
                //
                // Interrupt should have had time to fire and set
                // STA_User_canErrorReturnVal by now.
                //
                returnVal = STA_User_canErrorReturnVal;
            }

            if(STL_CAN_RAM_PASS == returnVal)
            {
                STA_Tests_passCount++;
                testReport = "\r\n\n\n TEST PASS: CAN Message RAM Parity Logic Test!\0";            }
            else
            {
                testReport = "\r\n\n\n TEST FAIL: CAN Message RAM Parity Logic Test!\0";
            }
            break;
        }

        case STA_FLASH_CRC:
        {
            //
            // Set range to calculate CRC for and the golden CRC value. For this
            // example, the first several words of the DCSM OTP are used.
            //
            uint32_t startAddress = DCSMBANK0_Z1OTP_BASE;
            uint32_t endAddress = DCSMBANK0_Z1OTP_BASE + 16;
            uint32_t goldenCRC = STA_USER_DCSM_OTP_GOLDEN_CRC;

            if(STA_Tests_injectError)
            {
                goldenCRC = goldenCRC ^ 0x0001U;
            }
#if STA_UTIL_PROFILE
            STA_Util_startProfiler(CPUTIMER1_BASE);
#endif

            uint16_t returnVal = STL_CRC_checkCRC(startAddress,
                                                  endAddress,
                                                  goldenCRC);

#if STA_UTIL_PROFILE
            uint32_t cycleCount = STA_Util_stopProfiler(CPUTIMER1_BASE);
            STA_Tests_cycleCounts[STA_FLASH_CRC] = cycleCount;
#endif
            if(STL_CRC_PASS == returnVal)
            {
                STA_Tests_passCount++;
                testReport = "\r\n\n\n TEST PASS: Flash CRC Test!\0";
            }
            else
            {
                testReport = "\r\n\n\n TEST FAIL: Flash CRC Test!\0";
            }
            break;
        }

        case STA_OSC_CT:
        {
            //
            // Initialize the Oscillator Timer2 test object.
            //
            STA_User_initOSCTimer2Test();

            if(STA_Tests_injectError)
            {
                //
                // Allow for zero range.
                //
                STA_User_oscTimer2Obj.minCount = STA_USER_OSC_DELAY_US;
                STA_User_oscTimer2Obj.maxCount = STA_USER_OSC_DELAY_US;
            }

