anyway-blows/ti-c2000-motor-control-sdk/c2000ware/libraries/diagnostic/f28002x/examples/test_application/sta_tests.c
#if STA_UTIL_PROFILE
            STA_Util_startProfiler(CPUTIMER1_BASE);
#endif

            STL_OSC_CT_startTest(STA_User_oscTimer2Handle);

#if STA_UTIL_PROFILE
            uint32_t cycleCount = STA_Util_stopProfiler(CPUTIMER1_BASE);
            STA_Tests_cycleCounts[STA_OSC_CT] = cycleCount;
#endif

            STL_Util_delayUS(STA_USER_OSC_DELAY_US);

#if STA_UTIL_PROFILE
            STA_Util_startProfiler(CPUTIMER1_BASE);
#endif

            uint16_t returnVal =
                STL_OSC_CT_stopTest(STA_User_oscTimer2Handle);

#if STA_UTIL_PROFILE
            cycleCount = STA_Util_stopProfiler(CPUTIMER1_BASE);
            STA_Tests_cycleCounts[STA_OSC_CT] += cycleCount;
#endif
            //
            // Run the oscillator test using Timer2.
            //
            if(STL_OSC_CT_FAIL == returnVal)
            {
                testReport = "\r\n\n\n TEST FAIL: OSC TIMER 2 Test!\0";
            }
            else
            {
                STA_Tests_passCount++;
                testReport = "\r\n\n\n TEST PASS: OSC TIMER 2 Test!\0";
            }

            break;
        }

        case STA_OSC_HR:
        {
            uint16_t testStatus;
            STA_User_initOSCHRTest();

            //
            // Shorten the MEP bounds by changing the max value to inject an
            // error.
            //
            // Calculating the expected MEP scale factor based on step size
            // listed in the Technical Reference Manual if EPWMCLK is 100 MHz:
            // (1/EPWMCLK)/Step size = (1/100 MHz)/150 ps is about 66.
            // mepMin and mepMax should be set to provide a range of a minimum
            // count of 3 greater and lower than the calculated value.
            // Setting mepMax lower than 66-3 = 63 will inject an error in
            // this particular test.
            //
            if(STA_Tests_injectError)
            {
                STA_User_oscHRObj.mepMin = STA_USER_OSC_HR_MEP_MAX;
            }

#if STA_UTIL_PROFILE
            STA_Util_startProfiler(CPUTIMER1_BASE);
#endif
            testStatus = STL_OSC_HR_testSFO(STA_User_oscHRHandle);
#if STA_UTIL_PROFILE
            uint32_t cycleCount = STA_Util_stopProfiler(CPUTIMER1_BASE);
            STA_Tests_cycleCounts[STA_OSC_HR] = cycleCount;
#endif

            if(STL_OSC_HR_PASS == testStatus)
            {
                STA_Tests_passCount++;
                testReport = "\r\n\n\n TEST PASS: OSC HRPWM Test!\0";
            }
            else
            {
                testReport = "\r\n\n\n TEST FAIL: OSC HRPWM Test!\0";
            }
            break;
        }

        case STA_TEST_END:
        {
            //
            // Convert test counts to characters and insert into the report.
            //
            STA_Tests_report[STA_TESTS_REPORT_PASS] =
                                        (STA_Tests_passCount / 10) + 48U;
            STA_Tests_report[STA_TESTS_REPORT_PASS + 1] =
                                        (STA_Tests_passCount % 10) + 48U;
            STA_Tests_report[STA_TESTS_REPORT_TOTAL] =
                                        ((STA_TESTS_NUMBERS - 2U) / 10) + 48U;
            STA_Tests_report[STA_TESTS_REPORT_TOTAL + 1] =
                                        ((STA_TESTS_NUMBERS - 2U) % 10) + 48U;

            testReport = STA_Tests_report;

            break;
        }

        default:
        {
            testReport = "\r\n\n\n No Test Specified\0";

            break;
        }
    }

    return(testReport);
}

//*****************************************************************************
//
// STA_Tests_injectErrorEnable(void)
//
//*****************************************************************************
void STA_Tests_injectErrorEnable(void)
{
    STA_Tests_injectError = true;
}

//*****************************************************************************
//
// STA_Tests_injectErrorDisable(void)
//
//*****************************************************************************
void STA_Tests_injectErrorDisable(void)
{
    STA_Tests_injectError = false;
}

//
// End of File
//
